Revit 2027 API
BuiltInFailures.LoadFailures.CannotMoveHostedLoad Property
 Can't move Load based on the Host Element.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId CannotMoveHostedLoad { get; }
Public Shared ReadOnly Property CannotMoveHostedLoad As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ CannotMoveHostedLoad {
	FailureDefinitionId^ get ();
}
static member CannotMoveHostedLoad : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.LoadFailures Class
Autodesk.Revit.DB Namespace